Updated Solution Design
